*** IN-PROGRESS [#A] [34/35] write test for following scripts
    #+BEGIN_SRC sh
    scripts=$(ls ./src/scripts/ -1 | wc -l)
    tests=$(ls ./test/ -1 | wc -l)
    test $scripts -lt $(expr $tests - 1) && echo "I'm not sure buy hey thumbs up +1!" || echo "You dumbass haven't even reached the miniumn number of tests."
    #+END_SRC

    #+RESULTS:
    : You dumbass haven't even reached the miniumn number of tests.

- [X] filterByTag.js
- [X] concatToValue.js
- [X] removeHelpElements.js
- [X] addEventsForSameContentKeys.js
- [X] buildCustomEvent.js
- [X] buildlResultElement.js
- [X] closeHelp.js
- [X] evalKeyFunction.js
- [X] removeButton.js
- [X] showHelp.js
- [X] storage.js
- [X] tooltip.js
- [X] registerSW.js
- [X] toggleKeyEvent.js
- [X] createUnitMarkup.js
- [X] backspace.js
- [X] appendUnits.js
- [X] unitEvalKey.js
- [X] removeUnits.js
- [X] sidebar.js
- [X] format.js
- [X] addEventForUnitKeys.js
- [X] pressure.js
- [X] power.js
- [X] mass.js
- [X] liquidVolume.js
- [X] length.js
- [X] force.js
- [X] energy.js
- [X] angles.js
- [X] volume.js
- [X] time.js
- [X] temperature.js
- [X] surface.js
- [ ] app.js

*** Miscellaneous
- [X] Add placeholder to input
- [X] Change random to rnd (random doesn't fit)
- [X] Fix the help box problem in 1366x768 resolution, it is not completely on screen frame.
- [X] When there're too many results firefox pushes the the keyboad down instead of showing an scroll bar 
- [ ] Highlight keys on hover for a little bit of feedback
- [ ] The whole thing doesn't work in Brave 
